ERP/src/InformationRegisters/СессииТелеграм.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СессииТелеграм</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НачалоСессии</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Бот</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Бот</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагент</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТелеграмИД</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ТелеграмИД</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

ERP/src/CommonModules/СессииТелеграм/Ext/Module.bsl
Функция ПолучитьКонтрагентаСессииИлиСоздать(ТелеграмИД, Бот, ПолноеИмяТелеграм="Клиент") Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	СессииТелеграм.Контрагент.Ссылка КАК КонтрагентСсылка
		|ИЗ
		|	РегистрСведений.СессииТелеграм КАК СессииТелеграм
		|ГДЕ
		|	СессииТелеграм.ТелеграмИД = &ТелеграмИД
		|	И СессииТелеграм.Бот = &Бот";
	
	Запрос.УстановитьПараметр("Бот", Бот);
	Запрос.УстановитьПараметр("ТелеграмИД", ТелеграмИД);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		
		СейчасДата = ТекущаяДата();
	
		НовыйКонтрагент = Справочники.Контрагент.СоздатьЭлемент();
		НовыйКонтрагент.Родитель = ПредопределенноеЗначение("Справочник.Контрагент.Клиенты");
		НовыйКонтрагент.Наименование = СтрШаблон("%1 (%2)", ПолноеИмяТелеграм, ТелеграмИД);
		НовыйКонтрагент.СекретныйКлюч = Строка(Новый УникальныйИдентификатор);
		НовыйКонтрагент.Записать();
		
		НоваяСессия = РегистрыСведений.СессииТелеграм.СоздатьМенеджерЗаписи();
		НоваяСессия.ТелеграмИД = ТелеграмИД;
		НоваяСессия.Бот = Бот;
		НоваяСессия.НачалоСессии = СейчасДата;
		НоваяСессия.Контрагент = НовыйКонтрагент.Ссылка;
		НоваяСессия.Записать(Истина);
		
		Возврат Новый Структура("Контрагент,Создано", НовыйКонтрагент.Ссылка, Истина);
		
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат Новый Структура("Контрагент,Создано", ВыборкаДетальныеЗаписи.КонтрагентСсылка, Ложь);
	
КонецФункции
